{"meta":{"title":"小九博客","subtitle":null,"description":"小九博客致力于分享程序员路上遇到的各种坑","author":"Joe shengxin","url":"https://war9.cn"},"pages":[{"title":"关于我","date":"2017-12-28T07:49:51.000Z","updated":"2018-01-10T05:55:01.551Z","comments":true,"path":"about/index.html","permalink":"https://war9.cn/about/index.html","excerpt":"","text":"关于作者 about me 个人信息 中文 English 乔盛欣/男/1994 Joe/Male/1994 本科/计算机科学与技术专业 Bachelor degree in computer science and techn 工作年限：经验应届(2018)毕业生 Graduating in 2018 博客：https://war9.cn Blog：https://war9.cn 联系方式 Welcome to contact me. &nbsp;Email: x9sec888@gmail.com / x9_sec@163.com Phone:132**6320 //请通过邮件联系获取 &nbsp;&nbsp;&nbsp;&nbsp;QQ:1649880988 捐助本站如果本站文章对您有所帮助，本站接受以捐助的形式来支持博主。十分感谢！本站默认会以支付名称写到捐助名单，如要修改捐助信息，请联系我！ 捐助排行 姓名 捐赠形式 捐赠时间 捐赠金额 联系方式 其它 王超 支付宝 2018-1-5 120元 QQ：976127505 赵建 支付宝 2018-1-9 60元 QQ：785011138 *丙昆 支付宝 2018-1-5 60元 QQ：3113229956 *志鹏 支付宝 2018-1-5 60元 QQ：1056609804 *港福 支付宝 2018-1-5 60元 QQ：1933588244"}],"posts":[{"title":"Yii2 Event事件-初识","slug":"Yii2-Event事件-初识","date":"2018-01-09T09:33:00.000Z","updated":"2018-01-10T03:13:40.565Z","comments":true,"path":"2018/01/09/Yii2-Event事件-初识.html","link":"","permalink":"https://war9.cn/2018/01/09/Yii2-Event事件-初识.html","excerpt":"","text":"yii2-事件 系列 第一篇 博主使用yii2时间不长,用于备忘分享，若有不正之处欢迎指正。十分感谢。本文仅用于快速使用yii2事件。后续文章将详细介绍yii2事件的更多细节。 前言最近在使用框架做项目中，多次使用到了Behavior。但是在使用的时候，切记不要盲目使用behavior，而是要区分场景。明白了场景到底需要什么的时候，再去选择使用事件(event)，还是行为(behavior)。 使用事件，可以在特定的时点，触发执行预先设定的一段代码，事件既是代码解耦的一种方式，也是设计业务流程的一种模式。现代软件中，事件无处不在，比如，你发了个微博，触发了一个事件，导致关注你的人，看到了你新发出来的内容。对于事件而言，有这么几个要素 [1]： yii2事件方法Event文件( \\yii\\base\\Event )函数模型：12345678910111213141516171819202122232425262728293031323334class Event extends Object&#123; public $name; // 事件名 public $sender; // 事件发布者，通常是调用了 trigger() 的对象或类。 public $handled = false; // 是否终止事件的后续处理 public $data; // 事件相关数据 private static $_events = []; public static function on($class, $name, $handler, $data = null, $append = true) &#123; // ... ... // 用于绑定事件handler &#125; public static function off($class, $name, $handler = null) &#123; // ... ... // 用于取消事件handler绑定 &#125; public static function hasHandlers($class, $name) &#123; // ... ... // 用于判断是否有相应的handler与事件对应 &#125; public static function trigger($class, $name, $event = null) &#123; // ... ... // 用于触发事件 &#125;&#125; on =&gt;绑定事件handler 一个最简单的绑定: 123456789&lt;?php\\yii\\base\\Event::on( BaseActiveRecord::className(),//需要绑定的类名 BaseActiveRecord::EVENT_BEFORE_INSERT,//绑定插入前事件 function ($event)&#123;//事件handler。这里的$event即是上面类中的Event。 echo 'I will insert a record into database'; //... &#125;); 以上例子表示将AR数据库插入之前事件，与自定义handler函数绑定。 off =&gt;解绑事件handler 一个最简单的解除绑定： 123456&lt;?php\\yii\\base\\Event::off( BaseActiveRecord::className(),//要接触绑定的类名 BaseActiveRecord::EVENT_AFTER_DELETE,//解除绑定的事件 //如果不写第三个参数，默认为null，将移除事件所有的handler。); 以上例子表示移除AR数据被删除后事件绑定的所有的handler.该函数将返回True或False表示是否找到并移除了该handler。 hasHandlers =&gt;判断这个类以及其父类的指定事件是否具有handler。 一个最简单的判断： 12345&lt;?php\\yii\\base\\Event::hasHandlers( BaseActiveRecord::className(),//要判断的类 BaseActiveRecord::EVENT_BEFORE_UPDATE//要判断的事件名称); 以上例子表示 判断AR类数据库记录变更行为下有没有handler。 注：仔细阅读了源码后，发现该函数不仅会检查指定的这个类，也会检查其所有的父类。 offAll =&gt;解除所有类级别的事件处理程序。 一个最简单的解除所有绑定： 12&lt;?php\\yii\\base\\Event::offAll(); Yii2 内置事件 在上面我们明白了如何绑定解绑事件，Yii2也很贴心的给我们提供了许多内置的事件，在这里列举一下，以用于快速查询。Tips:此内容可以在Yii2速查表里找到。 Application # 应用主体 应用处理请求before之前触发 Application::EVENT_BEFORE_REQUEST 应用处理请求before之后触发 Application::EVENT_AFTER_REQUEST Controller # 控制器 在每个Action运行之前触发 Controller::EVENT_BEFORE_ACTION 在每个Action运行之后触发 Controller::EVENT_AFTER_ACTION Model # 模型 在验证Model属性之前触发 Model::EVENT_BEFORE_VALIDATE 在验证Model属性之后触发 Model::EVENT_AFTER_VALIDATE Module # 模块 一个模块的Action运行前触发 Module::EVENT_BEFORE_ACTION 一个模块的Action运行后触发 Module::EVENT_AFTER_ACTION View # 视图 执行视图的beforePage时触发 View::EVENT_BEGIN_PAGE 执行视图的endPage函数时触发 View::EVENT_END_PAGE 在renderFile渲染一个视图文件之前触发 View::EVENT_BEFORE_RENDER 在renderFile渲染一个视图文件之后触发 View::EVENT_AFTER_RENDER 执行视图的beginBody函数时触发 View::EVENT_BEGIN_BODY 执行视图的endBody函数时触发 View::EVENT_END_BODY Widget # 挂件 Widget初始化时触发 Widget::EVENT_INIT Widget执行前触发 Widget::EVENT_BEFORE_RUN Widget执行之后触发 Widget::EVENT_AFTER_RUN ActiveQuery 由ActiveQuery的init函数触发 ActiveQuery::EVENT_INIT BaseActiveRecord &amp; ActiveRecord # 这也许是内置事件中最重要的一批了。 AR对象被初始化init时触发 BaseActiveRecord::EVENT_INIT AR执行查询结束时触发 BaseActiveRecord::EVENT_AFTER_FIND 插入结束时触发 BaseActiveRecord::EVENT_BEFORE_INSERT 插入之后触发 BaseActiveRecord::EVENT_AFTER_INSERT 更新记录之前触发 BaseActiveRecord::EVENT_BEFORE_UPDATE 更新记录之后触发 BaseActiveRecord::EVENT_AFTER_UPDATE 删除记录之前触发 BaseActiveRecord::EVENT_BEFORE_DELETE 删除记录之后触发 BaseActiveRecord::EVENT_AFTER_DELETE 在数据refresh成功之后触发 BaseActiveRecord::EVENT_AFTER_REFRESH Connection # 数据库连接 数据库连接被打开后触发 Connection::EVENT_AFTER_OPEN 事务被启动时触发 Connection::EVENT_BEGIN_TRANSACTION 事务被提交后触发 Connection::EVENT_COMMIT_TRANSACTION 事务回滚后触发 Connection::EVENT_ROLLBACK_TRANSACTION Response # Http响应 Response响应发送之前触发 Response::EVENT_BEFORE_SEND Response响应发送之后触发 Response::EVENT_AFTER_SEND Response响应内容准备好之后触发 Response::EVENT_AFTER_PREPARE User # 会员登陆授权 登陆之前触发 User::EVENT_BEFORE_LOGIN 登陆之后触发 User::EVENT_AFTER_LOGIN 注销之前触发 User::EVENT_BEFORE_LOGOUT 注销之后触发 User::EVENT_AFTER_LOGOUT 一些使用技巧使用事件不仅可以写到controller里面，实现这些用户注册成功触发SayHelloToUser事件这个场景。 也可以写到BootStrap文件中，实现一些比如全局安全检测，日志等功能。另外也可以写到配置文件中。下面简单介绍一下配置文件实现绑定事件handler的流程。 下面贴一个用户登录事件绑定的实现，代码实现了登录后修改最后登录时间。config/main.php 1234567891011'components' =&gt; [ 'user' =&gt; [ 'identityClass' =&gt; 'common\\models\\User', 'enableAutoLogin' =&gt; true, 'on afterLogin' =&gt; function($event)&#123; $user = $event-&gt;identity; $user-&gt;loginTime = time(); $user-&gt;save(); &#125; ],] 上面就是在配置文件中绑定事件handler的基本形式。大体模型如下：12345678'components' =&gt; [ '自定义component'=&gt;[ 'class'=&gt;'\\path\\自定义', 'on Event名称'=&gt; function($event)&#123; //handler内容 &#125; ],], 一些其它需要留意的地方 事件是基于Component的，而不是基于Object的。 Handler的形式必须是函数形式的。 文中部分内容引用自：[1]深入理解Yii2.0-事件","categories":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}],"tags":[{"name":"yii2","slug":"yii2","permalink":"https://war9.cn/tags/yii2/"},{"name":"yii2-event","slug":"yii2-event","permalink":"https://war9.cn/tags/yii2-event/"},{"name":"yii2事件","slug":"yii2事件","permalink":"https://war9.cn/tags/yii2事件/"}],"keywords":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}]},{"title":"Yii2 资源大全","slug":"Yii2-resources","date":"2018-01-08T07:15:00.000Z","updated":"2018-01-10T03:47:20.862Z","comments":true,"path":"2018/01/08/Yii2-resources.html","link":"","permalink":"https://war9.cn/2018/01/08/Yii2-resources.html","excerpt":"","text":"Yii2资源大全 本文将记录一些常用的Yii2 资源，比如教程，好的开源项目，工具等.另外一个好的项目 awesome-yii本文将不断更新,如有更好的资源，欢迎提出意见！ 工具 Yii2 速查表 学习笔记 Yii2 初学者笔记 工具 Yii2 速查表 Link:http://nai8.me/tool-sc.html Description: 可以快速查询以下知识： Composer DAO Logging Validator String Session&amp;Cookie Request Response Controller ActiveForm FileHelper UploadedFile Html Alias Query Builder Migrate Asset Management Event Route&amp;UrlManager RESTful 学习笔记 Yii2 初学者笔记Link:http://blog.csdn.net/qq704005406/article/details/78075396Description:这是我之前的博客写的日志，在初学Yii2的时候记的笔记，里面内容可能不严谨，适用于快速上手Yii2.","categories":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}],"tags":[{"name":"Yii2","slug":"Yii2","permalink":"https://war9.cn/tags/Yii2/"},{"name":"Yii2教程","slug":"Yii2教程","permalink":"https://war9.cn/tags/Yii2教程/"},{"name":"Yii2工具","slug":"Yii2工具","permalink":"https://war9.cn/tags/Yii2工具/"},{"name":"学习资料","slug":"学习资料","permalink":"https://war9.cn/tags/学习资料/"}],"keywords":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}]},{"title":"【[转]PHP资源大全】Awesome PHP 项目","slug":"awesomePHP","date":"2018-01-03T08:54:00.000Z","updated":"2018-01-08T08:06:05.955Z","comments":true,"path":"2018/01/03/awesomePHP.html","link":"","permalink":"https://war9.cn/2018/01/03/awesomePHP.html","excerpt":"","text":"项目地址:https://github.com/ziadoz/awesome-php Awesome PHPA curated list of amazingly awesome PHP libraries, resources and shiny things. Contributing and CollaboratingPlease see CONTRIBUTING, CODE-OF-CONDUCT and COLLABORATING for details. Table of Contents Awesome PHP Composer Packeg仓库 依赖关系管理 额外的依赖关系管理 框架 额外的框架 组件 微型框架 额外的微型框架 路由 模板 静态站点生成 HTTP 中间件 URL Email Files Streams 依赖注入 Imagery 测试 持续集成 Documentation 安全 密码学 代码分析 代码质量 静态分析 Architectural 调试性能分析 构建工具 Task Runners 导航 资源管理 地理位置 日期时间 事件 日志 电子商务 PDF Office Database 数据库迁移 NoSQL Queue队列 Search 命令行 身份验证和授权 Markup Strings Numbers 过滤和验证 API 缓存 数据结构和存储 通知 部署 国际化和本地化 第三方API 扩展 杂项 软件资源 PHP安装 开发环境 虚拟机 文本编辑器和IDE Web应用 Infrastructure Resources PHP站点 其它站点 PHP 书籍 PHP 视频 PHP 博客 PHP 阅读 PHP 内部阅读 贡献名单 Composer RepositoriesComposer Repositories. Firegento - Magento Module Composer Repository. Packagist - The PHP Package Repository. PaketHub - All-in-One PHP Package Repository. Private Packagist - Composer package archive as a service for PHP. WordPress Packagist - Manage your plugins with Composer. Zend Framework Packages - Zend Framework Composer Repository. Dependency ManagementLibraries for dependency and package management. Composer Installers - A multi framework Composer library installer. Composer - A package and dependency manager. Melody - A tool to build one file Composer scripts. Pickle - A PHP extension installer. Dependency Management ExtrasExtras related to dependency management. Composed - A library to parse your project’s Composer environment at runtime. Composer Checker - A tool to validate Composer configurations. Composer Merge Plugin - A composer plugin to merge several composer.json files. Composition - A library to check your Composer environment at runtime. NameSpacer - A library to convert from underscores to namespaces. Patch Installer - A library to install patches using Composer. Prestissimo - A composer plugin which enables parallel install process. Satis - A static Composer repository generator. tooly - A library to manage PHAR files in project using Composer. Toran Proxy - A static Composer repository and proxy. FrameworksWeb development frameworks. Aura Framework - A framework built from independent components. CakePHP - A rapid application development framework (CP). Laravel 5 - Another PHP framework (L5). Nette - Another framework comprised of individual components. Phalcon - A framework implemented as a C extension. PPI Framework 2 - An interoperability framework. Symfony - A framework comprised of individual components (SF). Yii2 - Another PHP framework. Zend Framework 2 - Another framework comprised of individual components (ZF2). Ice - Another simple and fast PHP framework delivered as C-extension. Framework ExtrasExtras related to web development frameworks. CakePHP CRUD - A Rapid Application Development (RAD) plugin for CakePHP. Knp RAD Components - A set of Rapid Application Development (RAD) components for Symfony. Symfony CMF - A Content Management Framework to create custom CMS. ComponentsStandalone components from web development frameworks and development groups. Aura - Independent components, fully decoupled from each other and from any framework. CakePHP Plugins - A directory of CakePHP plugins. Hoa Project - Another package of PHP components. League of Extraordinary Packages - A PHP package development group. Symfony Components - The components that make Symfony. Zend Framework 2 Components - The components that make Zend Framework. Micro FrameworksMicro frameworks and routers. Bullet PHP - A micro framework for building REST APIs. Lumen - A micro-framework by Laravel. Proton - A StackPHP compatible micro framework. Radar - An Action-Domain-Responder implementation for PHP. Silex - A micro framework built around Symfony components. Slim - Another simple micro framework. Micro Framework ExtrasExtras related to micro frameworks and routers. Silex Skeleton - A project skeleton for Silex. Silex Web Profiler - A web debug toolbar for Silex. Slim Skeleton - A skeleton for Slim. Slim View - A collection of custom views for Slim. RoutersLibraries for handling application routing. Aura.Router - A full-featured routing library. Fast Route - A fast routing library. Klein - A flexible router. Pux - Another fast routing library. Route - A routing library built on top of Fast Route. TemplatingLibraries and tools for templating and lexing. Aura.View - Provides TemplateView and TwoStepView using PHP as the tempting language, with support for partials, sections, and helpers. Foil - Another native PHP templating library. Lex - A lightweight template parser. MtHaml - A PHP implementation of the HAML template language. Mustache - A PHP implementation of the Mustache template language. Phly Mustache - Another PHP implementation of the Mustache template language. PHPTAL - A PHP implementation of the TAL templating language. Plates - A native PHP templating library. Smarty - A template engine to complement PHP. Twig - A comprehensive templating language. Tale Jade - A PHP implementation of the Jade template language. Static Site GeneratorsTools for pre-processing content to generate web pages. Couscous - Couscous turns Markdown documentation into beautiful websites. It’s GitHub Pages on steroids. Phrozn - Another tool that converts Textile, Markdown and Twig into HTML. Sculpin - A tool that converts Markdown and Twig into static HTML. Spress - An extensible tool that converts Markdown and Twig into HTML. HTTPLibraries for working with HTTP. Buzz - Another HTTP client. Guzzle - A comprehensive HTTP client. HTTPFul - A chainable HTTP client. HTTPlug - An HTTP client abstraction without binding to a specific implementation. PHP VCR - A library for recording and replaying HTTP requests. Requests - A simple HTTP library. Retrofit - A library to ease creation of REST API clients. zend-diactoros - PSR-7 HTTP Message implementation. ScrapingLibraries for scraping websites. Embed - An information extractor from any web service or page. Goutte - A simple web scraper. PHP Spider - A configurable and extensible PHP web spider. MiddlewaresLibraries for building application using middlewares. Expressive - PSR-7 Middleware framework from Zend. PSR7-Middlewares - Inspiring collection of handy middlewares. Relay - A PHP 5.5 PSR-7 middleware dispatcher. Stack - A library of stackable middleware for Silex/Symfony. zend-stratigility - Middleware for PHP built on top of PSR-7. URLLibraries for parsing URLs. PHP Domain Parser - A domain suffix parser library. Purl - A URL manipulation library. sabre/uri - A functional URI manipulation library. Uri - Another URL manipulation library. EmailLibraries for sending and parsing email. CssToInlineStyles - A library to inline CSS in email templates. Email Reply Parser - An email reply parser library. Email Validator - A small email address validation library. Fetch - An IMAP library. Mautic - Email marketing automation PHPMailer - Another mailer solution. Stampie - A library for email services such as SendGrid, PostMark, MailGun and Mandrill. SwiftMailer - A mailer solution. FilesLibraries for file manipulation and MIME type detection. Apache MIME Types - A library that parses Apache MIME types. Canal - A library to determine internet media types. CSV - A CSV data manipulation library. Ferret - A MIME detection library. Flysystem - Another filesystem abstraction layer. Gaufrette - A filesystem abstraction layer. Hoa Mime - Another MIME detection library. Lurker - A resource tracking library. PHP FFmpeg - A wrapper for the FFmpeg video library. UnifiedArchive - A unified reader and writer of compressed archives. StreamsLibraries for working with streams. Streamer - A simple object-orientated stream wrapper library. Dependency InjectionLibraries that implement the dependency injection design pattern. Aura.Di - A serializable dependency injection container with constructor and setter injection, interface and trait awareness, configuration inheritance, and much more. Acclimate - A common interface to dependency injection containers and service locators. Auryn - A recursive dependency injector. Container - Another flexible dependency injection container. Disco - A PSR-11 compatible, annotation-based dependency injection container. PHP-DI - A dependency injection container that supports autowiring. Pimple - A tiny dependency injection container. Symfony DI - A dependency injection container component (SF). ImageryLibraries for manipulating images. Color Extractor - A library for extracting colours from images. GIF Creator - A library to create GIF animations from multiple images. GIF Frame Extractor - A library to extract GIF animation frame information. Glide - An on-demand image manipulation library. Image Hash - A library for generating perceptual image hashes. Image Optimizer - A library for optimizing images. Image With Text - A library for embedding text into images. Imagine - An image manipulation library. Intervention Image - Another image manipulation library. PHP Image Workshop - Another image manipulation library. TestingLibraries for testing codebases and generating test data. Alice - An expressive fixture generation library. AspectMock - A mocking framework for PHPUnit/Codeception. Atoum - A simple testing library. Behat - A behaviour driven development (BDD) testing framework. Codeception - A full stack testing framework. DBUnit - A database testing library for PHPUnit. Faker - A fake data generator library. HTTP Mock - A library for mocking HTTP requests in unit tests. Kahlan - Full stack Unit/BDD testing framework with built-in stub, mock and code-coverage support. Mink - Web acceptance testing. Mockery - A mock object library for testing. ParaTest - A parallel testing library for PHPUnit. Peridot - An event driven test framework. Phake - Another mock object library for testing. Pho - Another behaviour driven development testing framework. PHP-Mock - A mock library for built-in PHP functions (e.g. time()). PHPSpec - A design by specification unit testing library. PHPT - A test tool used by PHP itself. PHPUnit - A unit testing framework. Prophecy - A highly opinionated mocking framework. Samsui - Another fake data generator library. VFS Stream - A virtual filesystem stream wrapper for testing. VFS - Another virtual filesystem for testing. Continuous IntegrationLibraries and applications for continuous integration. CircleCI - A continuous integration platform. GitlabCi - Let GitLab CI test, build, deploy your code. TravisCi like. Jenkins - A continous integration platform with PHP support. JoliCi - A continuous integration client written in PHP and powered by Docker. PHPCI - An open source continuous integration platform for PHP. SemaphoreCI - A continuous integration platform for open source and private projects. Shippable - A docker based continious integration platform for open source and private projects. Sismo - A continuous testing server library. Travis CI - A continuous integration platform. Wercker - A continuous integration platform DocumentationLibraries for generating project documentation. APIGen - Another API documentation generator. daux.io - A documentation generator which uses Markdown files. PHP Documentor 2 - A documentation generator. phpDox - A documentation generator for PHP projects (that is not limited to API documentation). Sami - An API documentation generator. SecurityLibraries for generating secure random numbers, encrypting data and scanning for vulnerabilities. Halite - A simple library for encryption using libsodium. HTML Purifier - A standards compliant HTML filter. IniScan - A tool that scans PHP INI files for security. Optimus - Id obfuscation based on Knuth’s multiplicative hashing method. PHP Encryption - Secure PHP Encryption Library. PHP IDS - A structured PHP security layer. PHP SSH - An experimental object orientated SSH wrapper library. PHPSecLib - A pure PHP secure communications library. random_compat - PHP 5.x support for random_bytes() and random_int() RandomLib - A library for generating random numbers and strings. SecurityMultiTool - A PHP security library. SensioLabs Security Check - A web tool to check your Composer dependencies for security advisories. TCrypto - A simple encrypted key-value storage library. VAddy - A continuous security testing platform for web applications. Zed - An integrated penetration testing tool for web applications. PasswordsLibraries and tools for working with and storing passwords. GenPhrase - A library for generating secure random passphrases. Password Compat - A compatibility library for the new PHP 5.5 password functions. Password Policy - A password policy library for PHP and JavaScript. Password Validator - A library for validating and upgrading password hashes. Password-Generator - PHP library to generate random passwords. PHP Password Lib - A library for generating and validating passwords. phpass - A portable password hashing framework. Zxcvbn PHP - A realistic PHP password strength estimate library based on Zxcvbn JS. Code AnalysisLibraries and tools for analysing, parsing and manipulating codebases. Better Reflection - AST-based reflection library that allows analysis and manipulation of code Code Climate - An automated code review. PHP Parser - A PHP parser written in PHP. PHP Semantic Versioning Checker - A command line utility that compares two source sets and determines the appropriate semantic versioning to apply. PHPLOC - A tool for quickly measuring the size of a PHP project. PHPQA - A tool for running QA tools (phploc, phpcpd, phpcs, pdepend, phpmd, phpmetrics). Qafoo Quality Analyzer - A tool to visualize metrics and source code. Scrutinizer - A web tool to scrutinise PHP code. UBench - A simple micro benchmark library. Code QualityLibraries for managing code quality, formatting and linting. PHP CodeSniffer - A library that detects PHP, CSS and JS coding standard violations. PHP CS Fixer - A coding standards fixer library. PHP Mess Detector - A library that scans code for bugs, sub-optimal code, unused parameters and more. PHPCheckstyle - A tool to help adhere to certain coding conventions. PHPCPD - A library that detects copied and pasted code. Static AnalysisLibraries for performing static analysis of PHP code. Exakat - A static analysis engine for PHP. Mondrian - A code analysis tool using Graph Theory. phan - A static analyzer based on PHP 7+ and the php-ast extension. PHPCompatibility - A PHP compatibility checker for PHP CodeSniffer. PhpDependencyAnalysis - A tool to create customisable dependency graphs. PHP Metrics - A static metric library. PHP Migration - A static analyzer for PHP version migration. PHPStan - A PHP Static Analysis Tool. Pslam - A static analysis tool for finding errors in PHP applications. ArchitecturalLibraries related to design patterns, programming approaches and ways to organize code. Compose - A function composition library. Design Patterns PHP - A repository of software patterns implemented in PHP. Finite - A simple PHP finite state machine. Functional PHP - A functional programming library. Galapagos - Evolutionary language transformation. Iter - A library that provides iteration primitives using generators. Monad PHP - A simple Monad library. Patchwork - A library for redefining userland functions. PHP Option - An option type library. Pipeline - A pipeline pattern implementation. Ruler - A simple stateless production rules engine. RulerZ - A powerful rule engine and implementation of the Specification pattern. Debugging and ProfilingLibraries and tools for debugging and profiling code. APM - Monitoring extension collecting errors and statistics into SQLite/MySQL/StatsD. Barbushin PHP Console - Another web debugging console using Google Chrome. Blackfire.io - A low-overhead code profiler. Kint - A debugging and profiling tool. PHP Console - A web debugging console. PHP Debug Bar - A debugging toolbar. PHPBench - A benchmarking Framework. Tideways.io - Monitoring and profiling tool Tracy - A simple error detection, logging and time measuring library. xDebug - A debug and profile tool for PHP. XHProf - A profiling tool originally developed by Facebook. Z-Ray - A debug and profile tool for Zend Server. Build ToolsProject build and automation tools. Bob - A simple project automation tool. Box - A utility to build PHAR files. Construct - A PHP project/micro-package generator. Phake - A rake PHP clone library. Phing - A PHP project build system inspired by Apache Ant. Task RunnersLibraries for automating and running tasks. Bldr - A PHP Task runner built on Symfony components. Jobby - A PHP cron job manager without modifying crontab. Robo - A PHP Task runner with object-orientated configurations. Task - A pure PHP task runner inspired by Grunt and Gulp. NavigationTools for building navigation structures. KnpMenu - A menu library. Asset ManagementTools for managing, compressing and minifying website assets. JShrink - A JavaScript minifier library. Munee - An asset optimiser library. Puli - A library for determining assets absolute paths. BowerPHP - A PHP implementation of Bower. A package manager for the web GeolocationLibraries for geocoding addresses and working with latitudes and longitudes. GeoCoder - A geocoding library. GeoJSON - A GeoJSON implementation. GeoTools - A library of geo-related tools. PHPGeo - A simple geo library. Date and TimeLibraries for working with dates and times. CalendR - A calendar management library. Carbon - A simple DateTime API extension. Chronos - A DateTime API extension supporting both mutable and immutable date/time. Moment.php - Moment.js inspired PHP DateTime handler with i18n support. Yasumi - An library to help you calculate the dates and names of holidays. EventLibraries that are event-driven or implement non-blocking event loops. Amp - An event driven non-blocking I/O library. Broadway - An event source and CQRS library. Cake Event - An event dispatcher library (CP). Elephant.io - Yet another web socket library. Evenement - An event dispatcher library. Event - An event library with a focus on domain events. Hoa EventSource - An event source library. Hoa WebSocket - Another web socket library. Prooph Event Store - An event source component to persist event messages Ratchet - A web socket library. React - An event driven non-blocking I/O library. Rx.PHP - A reactive extension library. Workerman - An event driven non-blocking I/O library. LoggingLibraries for generating and working with log files. Monolog - A comprehensive logger. E-commerceLibraries and applications for taking payments and building online e-commerce stores. Money - A PHP implementation of Fowler’s money pattern. OmniPay - A framework agnostic multi-gateway payment processing library. Payum - A payment abstraction library. Shopware - Highly customizable e-commerce software Swap - An exchange rates library. Sylius - An open source e-commerce solution. PDFLibraries and software for working with PDF files. Dompdf - A HTML to PDF converter. PHPPdf - A library for generating PDFs and images from XML. Snappy - A PDF and image generation library. WKHTMLToPDF - A tool to convert HTML to PDF. OfficeLibraries for working with office suite documents. ExcelAnt - A library for manipulating Microsoft Excel documents. PHPPowerPoint - A library for working with Microsoft PowerPoint Presentations. PHPWord - A library for working with Microsoft Word documents. PHPSpreadsheet - A pure PHP library for reading and writing spreadsheet files (successor of PHPExcel) DatabaseLibraries for interacting with databases using object-relational mapping (ORM) or datamapping techniques. Atlas.Orm - A data mapper implementation for your persistence model in PHP. Aura.Sql - Provides an extension to the native PDO along with a profiler and connection locator. Aura.SqlQuery - Independent query builders for MySQL, PostgreSQL, SQLite, and Microsoft SQL Server. Baum - A nested set implementation for Eloquent. Cake ORM - Object-Relational Mapper, implemented using the DataMapper pattern (CP). Doctrine Extensions - A collection of Doctrine behavioural extensions. Doctrine - A comprehensive DBAL and ORM. Eloquent - A simple ORM (L5). LazyRecord - A fast ORM designed for simplicity, extendability and performance. Pomm - An Object Model Manager for PostgreSQL. Propel - A fast ORM, migration library and query builder. ProxyManager - A set of utilities to generate proxy objects for data mappers. RedBean - A lightweight, configuration-less ORM. Spot2 - A MySQL datamapper ORM. MigrationsLibraries to help manage database schemas and migrations. Doctrine Migrations - A migration library for Doctrine. Migrations - A migration management library. Phinx - Another database migration library. PHPMig - Another migration management library. Ruckusing - Database migrations for PHP ala ActiveRecord Migrations with support for MySQL, Postgres, SQLite. NoSQLLibraries for working with “NoSQL” backends. Monga - A MongoDB abstraction library. MongoQB - A MongoDB query builder library. PHPMongo - A MongoDB ORM. Predis - A feature complete Redis library. QueueLibraries for working with event and task queues. Bernard - A multibackend abstraction library. BunnyPHP - A performant pure-PHP AMQP (RabbitMQ) sync and also async (ReactPHP) library. Pheanstalk - A Beanstalkd client library. PHP AMQP - A pure PHP AMQP library. Tarantool Queue - PHP bindings for Tarantool Queue. Thumper - A RabbitMQ pattern library. SearchLibraries and software for indexing and performing search queries on data. Elastica - A client library for ElasticSearch. ElasticSearch PHP - The official client library for ElasticSearch. Solarium - A client library for Solr. Sphinx Search - Sphinx Search library provides SphinxQL indexing and searching features SphinxQL query builder - A query library for the Sphinx search engine. Command LineLibraries related to the command line. Aura.Cli - Provides the equivalent of request ( Context ) and response ( Stdio ) objects for the command line interface, including Getopt support, and an independent Help object for describing commands. Boris - A tiny PHP REPL. Cilex - A micro framework for building command line tools. CLI Menu - A library for building CLI menus. CLIFramework - A command-line framework supports zsh/bash completion generation, subcommands and option constraints. It also powers phpbrew. CLImate - A library for outputting colours and special formatting. Commando - Another simple command line opt parser. Cron Expression - A library to calculate cron run dates. GetOpt - A command line opt parser. GetOptionKit - Another command line opt parser. Hoa Console - Another command line library. OptParse - Another command line opt parser. Pecan - An event-driven, non-blocking shell. PsySH - Another PHP REPL. ShellWrap - A simple command line wrapper library. Authentication and AuthorizationLibraries for implementing user authentication and authorization. Aura.Auth - Provides authentication functionality and session tracking using various adapters. Hawk - A Hawk HTTP authentication library. SocialConnect Auth - An open source social sign (OAuth1\\OAuth2\\OpenID\\OpenIDConnect). Json Web Token - Json Tokens to authenticate and transmit information. OAuth 1.0 Client - An OAuth 1.0 client library. OAuth 2.0 Client - An OAuth 2.0 client library. OAuth2 Server - Another OAuth2 server implementation. OAuth2 Server - An OAuth2 authentication server, resource server and client library. Opauth - A multi-provider authentication framework. PHP oAuthLib - Another OAuth library. Sentinel Social - A library for social network authentication. Sentinel - A framework agnostic authentication &amp; authorisation library. TwitterOAuth - A Twitter OAuth library. TwitterSDK - A fully tested Twitter SDK. MarkupLibraries for working with markup. Cebe Markdown - An fast and extensible Markdown parser. Ciconia - Another Markdown parser that supports Github flavoured Markdown. CommonMark PHP - A Markdown parser which supports the full CommonMark spec. Decoda - A lightweight markup parser library. Emoji - A library that converts unicode characters and names into emoji images. HTML to Markdown - Converts HTML into Markdown. HTML5 PHP - An HTML5 parser and serializer library. Parsedown - Another Markdown parser. PHP Markdown - A Markdown parser. StringsLibraries for parsing and manipulating strings. Agent - A PHP desktop/mobile user agent parser, based on Mobiledetect. ANSI to HTML5 - An ANSI to HTML5 converter library. Color Jizz - A library for manipulating and converting colours. Device Detector - Another library for parsing user agent strings. Hoa String - Another UTF-8 string library. Jieba-PHP - A PHP port of Python’s jieba. Chinese text segmentation for natural language processing. Mobile-Detect - A lightweight PHP class for detecting mobile devices (including tablets). Patchwork UTF-8 - A portable library for working with UTF-8 strings. Slugify - A library to convert strings to slugs. SQL Formatter - A library for formatting SQL statements. Stringy - A string manipulation library with multibyte support. Text - A text manipulation library. UA Parser - A library for parsing user agent strings. URLify - A PHP port of Django’s URLify.js. UUID - A library for generating UUIDs. NumbersLibraries for working with numbers. ByteUnits - A library to parse, format and convert byte units in binary and metric systems. LibPhoneNumber for PHP - A PHP implementation of Google’s phone number handling library. Math - A library for working with large numbers. Numbers PHP - A library for working with numbers. PHP Conversion - Another library for converting between units of measure. PHP Units of Measure - A library for converting between units of measure. Filtering and ValidationLibraries for filtering and validating data. Aura.Filter - Provides tools to validate and sanitize objects and arrays. Cake Validation - Another validation library (CP). DMS Filter - An annotation filtering library. Filterus - A simple PHP filtering library. ISO-codes - A library for validating inputs according standards from ISO, International Finance, Public Administrations, GS1, Book Industry, Phone numbers &amp; Zipcodes for many countries MetaYaml - A schema validation library that supports YAML, JSON and XML. Respect Validation - A simple validation library. Upload - A library for handling file uploads and validation. Valitron - Another validation library. Volan - Another simplified validation library. APILibraries and web tools for developing APIs. API Platform - Expose in minutes an hypermedia REST API that embraces JSON-LD, Hydra format. Apigility - An API builder built with Zend Framework 2. Drest - A library for exposing Doctrine entities as REST resource endpoints. HAL - A Hypertext Application Language (HAL) builder library. Hateoas - A HATEOAS REST web service library. Negotiation - A content negotiation library. Restler - A lightweight framework to expose PHP methods as RESTful web API. wsdl2phpgenerator - A tool to generate PHP classes from SOAP WSDL files. CachingLibraries for caching data. Alternative PHP Cache (APC) - Open opcode cache for PHP. APIx Cache - A thin PSR-6 cache wrapper to various caching backends emphasising cache tagging and indexing. CacheTool - A tool to clear APC/opcode caches from the command line. Cake Cache - A caching library (CP). Doctrine Cache - A caching library. Metaphore - Cache slam defense using a semaphore to prevent dogpile effect. Stash - Another library for caching. Zend Cache - Another caching library (ZF2). Data Structure and StorageLibraries that implement data structure or storage techniques. Ardent - A library of data structures. Cake Collection - A simple collections library (CP). Collections - Collections Abstraction library for PHP. Fractal - A library for converting complex data structures to JSON output. Ginq - Another PHP library based on .NET’s LINQ. JsonMapper - A library that maps nested JSON structures onto PHP classes. Knapsack - Collection library inspired by Clojure’s sequences. PHP Collections - A simple collections library. PINQ - A PHP library based on .NET’s LINQ (Language Integrated Query). Porter - Data import abstraction framework. Serializer - A library for serialising and de-serialising data. Totem - A library to manage and create data changesets. YaLinqo - Yet Another LINQ to Objects for PHP. Zend Serializer - Another library for serialising and de-serialising data (ZF2). NotificationsLibraries for working with notification software. JoliNotif - A cross-platform library for desktop notification (support for Growl, notify-send, toaster, etc) Nod - A notification library (e.g., Growl). Notification Pusher - A standalone library for device push notifications. Notificato - A library for handling push notifications. Notificator - A lightweight notification library. Php-pushwoosh - A PHP Library to easily send push notifications with the Pushwoosh REST Web Services. DeploymentLibraries for project deployment. Deployer - A deployment tool. Envoy - A tool to run SSH tasks with PHP. Plum - A deployer library. Pomander - A deployment tool for PHP applications. Rocketeer - A fast and easy deployer for the PHP world. Internationalisation and LocalisationLibraries for Internationalization (I18n) and Localization (L10n). Aura.Intl - Provides internationalization (I18N) tools, specifically package-oriented per-locale message translation. Cake I18n - Message translation and localization for dates and numbers (CP) Third Party APIsLibraries for accessing third party APIs. Amazon Web Service SDK - The official PHP AWS SDK library. Campaign Monitor - The official Campaign Monitor PHP library. Digital Ocean - A library to interface with the Digital Ocean API. Dropbox SDK - The official PHP Dropbox SDK library. Github - A library to interface with the Github API. Mailgun The official Mailgun PHP API. PHP Github API - Another library to interface with the Github API. S3 Stream Wrapper - A stream wrapper library for Amazon S3. Stripe - The official Stripe PHP library. Twilio - The official Twilio PHP REST API. Twitter OAuth - A library to interface with Twitter’s OAuth workflow. Twitter REST - A library to interact with Twitter’s REST API. ExtensionsLibraries to help build PHP extensions. PHP CPP - A C++ library for developing PHP extensions. Zephir - A compiled language between PHP and C++ for developing PHP extensions. MiscellaneousUseful libraries or tools that don’t fit in the categories above. Annotations - An annotations library (part of Doctrine). BotMan - A framework agnostic PHP library to build cross-platform chat bots. Cake Utility - Utility classes such as Inflector, String, Hash, Security and Xml (CP). Chief - A command bus library. ClassPreloader - A library for optimising autoloading. Country List - A list of all countries with names and ISO 3166-1 codes. Embera - An Oembed consumer library. Essence - A library for extracting web media. Flux - A regular expression building library. Graphviz - A Graphviz library. Hprose-PHP - A very newbility RPC Library, support 25+ languages now. JSON Lint - A JSON lint utility. JSONPCallbackValidator - A library for validating JSONP callbacks. Jumper - A remote service executor library. LadyBug - A dumper library. Lambda PHP - A Lambda calculus interpreter in PHP. LiteCQRS - A CQRS (Command Query Responsibility Separation) library. Metrics - A simple metrics API library. noCAPTCHA - Helper for Google’s noCAPTCHA (reCAPTCHA). Nmap - A PHP wrapper around Nmap. Opengraph - An opengraph library. Pagerfanta - A pagination library. PHP Expression - A PHP expression language. PHP PassBook - A PHP library for iOS PassBook. PHP-GPIO - A library for playing with the Raspberry PI’s GPIO pins. PHP-ML - A library for Machine Learning in PHP. PHPCR - A PHP port of the Java Content Repository (JCR). PHPStack - A TCP/IP stack proof of concept written in PHP. print_o - An object graph visualizer. Procrastinator - A library for running time consuming tasks. Prooph Service Bus - Lightweight message bus supporting CQRS and Micro Services RMT - A library for versioning and releasing software. sabre/vobject - A library for parsing VCard and iCalendar objects. Slimdump - An easy dumper tool for MySQL. Spork - A process forking library. Sslurp - A library that makes dealing with SSL suck less. SuperClosure - A library that allows Closures to be serialized. Symfony VarDumper - A variable dumper component (SF). Underscore - A PHP port of the Underscore JS library. Whoops - A pretty error handling library. SoftwareSoftware for creating a development environment. PHP InstallationTools to help install and manage PHP on your computer. HomeBrew PHP - A PHP tap for HomeBrew. HomeBrew - A package manager for OSX. PHP Brew - A PHP version manager and installer. PHP Build - Another PHP version installer. PHP Env - Another PHP version manager. PHP OSX - A PHP installer for OSX. PHP Switch - Another version manager. VirtPHP - A tool for creating and managing isolated PHP environments. Development EnvironmentSoftware and tools for creating a sandboxed development environment. Ansible - A radically simple orchestration framework. Phansible - A web tool for building PHP development virtual machines with Ansible. Protobox - Another web tool for building PHP development virtual machines. PuPHPet - A web tool for building PHP development virtual machines. Puppet - A server automation framework and application. Vagrant - A portable development environment utility. Docker - A containerization platform. Virtual MachinesAlternative PHP virtual machines. Hack - A programming language for HHVM that interoperates seamlessly with PHP. HHVM - A Virtual Machine, Runtime and JIT for PHP by Facebook. HippyVM - Another PHP virtual machine. Text Editors and IDEsText Editors and Integrated Development Environments (IDE) with support for PHP. Atom - A hackable text editor. Atom IDE - An IDE extension for Atom. Eclipse for PHP Developers - A PHP IDE based on the Eclipse platform. Netbeans - An IDE with support for PHP and HTML5. PhpStorm - A commercial PHP IDE. VS Code - An open source code editor. Web ApplicationsWeb-based applications and tools. 3V4L - An online PHP &amp; HHVM shell. DBV - A database version control application. PHP Queue - An application for managing queueing backends. MailCatcher - A web tool for capturing and viewing emails. Cachet - The open source status page system. phpBeanstalkdAdmin - Monitoring and administration interface for Beanstalkd. phpRedisAdmin - A simple web interface to manage Redis databases. phpPgAdmin - A web-based administration tool for PostgreSQL. phpMyAdmin - A web interface for MySQL/MariaDB. Adminer - Database management in a single PHP file. Grav - A modern flat-file CMS. Lychee - An easy to use and great looking photo-management-system. InfrastructureInfrastructure for providing PHP applications and services. appserver.io - A multithreaded application server for PHP, written in PHP. php-pm - A process manager, supercharger and load balancer for PHP applications. ResourcesVarious resources, such as books, websites and articles, for improving your PHP development skills and knowledge. PHP WebsitesUseful PHP-related websites. Nomad PHP - A online PHP learning resource. PHP Best Practices - A PHP best practice guide. PHP FIG - The PHP Framework Interoperability Group. PHP Mentoring - Peer to peer PHP mentorship organization. PHP Package Development Standards - Package development standards for PHP. PHP School - Open Source Learning for PHP. PHP Security - A guide to PHP security. PHP The Right Way - A PHP best practice quick reference guide. PHP UG - A website to help people locate their nearest PHP user group (UG). PHP Versions - Lists which versions of PHP are available on several popular web hosts. PHP Weekly - A weekly PHP newsletter. PHPTrends - An overview of fastest growing PHP libraries. Securing PHP - A newsletter about PHP security and library recommendations. Seven PHP - A website that interviews members of the PHP community. PHP Annotated Monthly - A monthly digest of PHP news. Other WebsitesUseful websites related to web development. Atlassian Git Tutorials - A series of Git tutorials. Hg Init - A series of Mercurial tutorials. Learning Linux - A website for learning Linux. Semantic Versioning - A website explaining semantic versioning. Servers for Hackers - A newsletter about server management. The Open Web Application Security Project (OWASP) - An open software security community. WebSec IO - A web security community resource. PHP BooksFantastic PHP-related books. Functional Programming in PHP - This book will show you how to leverage these new PHP5.3+ features by understanding functional programming principles Grumpy PHPUnit - A book about unit testing with PHPUnit by Chris Hartjes. Mastering Object-Orientated PHP - A book about object-orientated PHP by Brandon Savage. Modern PHP New Features and Good Practices - A book about new PHP features and best practices by Josh Lockhart. Modernizing Legacy Applications in PHP - A book about modernizing legacy PHP applications by Paul M. Jones. PHP 7 Upgrade Guide - An ebook covering all of the features and changes in PHP 7 by Colin O’Dell. PHP Pandas - A book about learning to write PHP by Dayle Rees. Scaling PHP Applications - An ebook about scaling PHP applications by Steve Corona. Securing PHP: Core Concepts - A book about common security terms and practices for PHP by Chris Cornutt. Signaling PHP - A book about catching PCNTL signals in CLI scripts by Cal Evans. The Grumpy Programmer’s Guide to Building Testable PHP Applications - A book about building testing PHP applications by Chris Hartjes. XML Parsing with PHP - This book covers parsing and validating XML documents, leveraging XPath expressions, and working with namespaces as well as how to create and modify XML files programmatically. Domain-Driven Design in PHP - Real examples written in PHP showcasing DDD Architectural Styles. Other BooksBooks related to general computing and web development. Elasticsearch: The Definitive Guide - A guide to working with Elasticsearch by Clinton Gormley and Zachary Tong. Eloquent JavaScript - A book about JavaScript programming by Marijn Haverbeke. Head First Design Patterns - A book that expains software design patterns. Pro Git - A book about Git by Scott Chacon and Ben Straub. The Linux Command Line - A book about the Linux command line by William Shotts. The Tangled Web — Securing Web Applications - A book about securing web applications by Michal Zalewski. Understanding Computation - A book about computation theory by Tom Stuart. Vagrant Cookbook - A book about creating Vagrant environments by Erika Heidi. PHP VideosFantastic PHP-related videos. Nomad PHP Lightning Talks - 10 to 15 minute Lightning Talks by PHP community members. PHP UK Conference - A collection of videos from the PHP UK Conference. Programming with Anthony - A video series by Anthony Ferrara. Taking PHP Seriously - A talk outlining PHP’s strengths by Keith Adams of Facebook. PHP PodcastsPodcasts with a focus on PHP topics. PHP Town Hall - A casual PHP podcast by Ben Edmunds and Phil Sturgeon. Voices of the ElePHPant Interviews with the people that make the PHP community special. PHP Roundtable - The PHP Roundtable is a casual gathering of developers discussing topics that PHP nerds care about. Voices of the ElePHPant - Interviews with members of PHP community. PHP ReadingPHP-releated reading materials. Composer Primer - A Composer primer. Composer Stability Flags - An article about Composer stability flags. Composer Versioning - An article about Composer versioning. Create Your Own PHP Framework - A series of articles on how to make your own PHP framework by Fabien Potencier. Don’t Worry About BREACH - An article about the BREACH hack and CSRF tokens. On PHP 5.3, Lambda Functions and Closures - An article about lambda functions and closures. PHP Is Much Better Than You Think - An article about the PHP language and ecosystem. PHP Package Checklist - A checklist for successful PHP package development. PHP Sucks! But I Like It! - An article about the pros and cons of PHP. Preventing CSRF Attacks - An article on preventing CSRF attacks. Seven Ways to Screw Up BCrypt - An article about correct BCrypt implementation. Use Env - An article about using the unix environment helper. PHP Internals ReadingReading materials related to the PHP internals or performance. Disproving the Single Quotes Myth - An article about performance of single and double quoted strings. How Big Are PHP Arrays (And Values) Really? - An article about array internals. How Foreach Works - A detailed StackOverflow answer about foreach. How Long is a Piece of String - An article about string internals. PHP Evaluation Order - An article about evaluation order in PHP. PHP Internals Book - An online book about PHP internals, written by three core developers. PHP RFCs - The home of PHP RFCs (Request for Comments). Print vs Echo, Which One is Faster? - An article about print and echo performance. The PHP Ternary Operator. Fast or Not? - An article ternary performance. Understanding OpCodes - An article about opcodes. When Does Foreach Copy? - An article about the internals of foreach. Why Objects (Usually) Use Less Memory Than Arrays - An article about object and array internals. You’re Being Lied To - An article about internal ZVALs. Collecting Garbage: 1 2 3 - A series about the PHP garbage collection internals. PHP Source Code for Developers: 1 2 3 4 - A series about the PHP source code. PHP 杂志Fantastic PHP-related magazines. php[architect] - A monthly magazine dedicated to PHP.","categories":[{"name":"PHP","slug":"php","permalink":"https://war9.cn/categories/php/"}],"tags":[{"name":"学习资料","slug":"学习资料","permalink":"https://war9.cn/tags/学习资料/"},{"name":"PHP","slug":"PHP","permalink":"https://war9.cn/tags/PHP/"},{"name":"PHP资源","slug":"PHP资源","permalink":"https://war9.cn/tags/PHP资源/"},{"name":"php组件","slug":"php组件","permalink":"https://war9.cn/tags/php组件/"},{"name":"php框架","slug":"php框架","permalink":"https://war9.cn/tags/php框架/"}],"keywords":[{"name":"PHP","slug":"php","permalink":"https://war9.cn/categories/php/"}]},{"title":"Yii2 Audit插件的使用【日志记录插件】","slug":"yii2-audit插件的使用","date":"2018-01-02T04:47:00.000Z","updated":"2018-01-08T07:13:28.581Z","comments":true,"path":"2018/01/02/yii2-audit插件的使用.html","link":"","permalink":"https://war9.cn/2018/01/02/yii2-audit插件的使用.html","excerpt":"","text":"Yii2 Audit 插件的使用 Yii2-Audit插件是一个功能齐全的，用于记录和显示web 、 cli请求、数据库更改、php /js错误和相关数据的插件。 并且该插件是以module的形式安装于Yii中，使用起来极为方便。 项目地址：https://github.com/bedezign/yii2-audit 文档地址：https://bedezign.github.io/yii2-audit/ 功能清单[点击可跳转到对应介绍] 【Entries】记录Web、Cli请求 (核心功能) 【Trails】记录数据库变更 【Javascripts】记录JavaScript错误记录 【Errors】记录Yii2错误记录 记录cURL请求 记录SOAP请求 记录请求中发送的邮件 数据可视化统计 1.安装 1.1 本插件依赖于PHP mail parse扩展,如若使用请安装php_mailparse 并修改php.ini 启用该扩展 1.2 使用Composer安装源文件 1composer require --prefer-dist bedezign/yii2-audit:\"dev-master\" 1.3 导入数据库 1php yii migrate --migrationPath=@bedezign/yii2/audit/migrations 注意：导入前common/main-local里的数据库必须有一个名称为db的数据库配置。否则会报错。1234567'db' =&gt; [ 'class' =&gt; 'yii\\db\\Connection', 'dsn' =&gt; 'mysql:host=localhost;port=3306;dbname=yii2-audit', 'username' =&gt; 'root', 'password' =&gt; '', 'charset' =&gt; 'utf8',], 1.4 最简配置编辑config/main.php,在modules下加入：audit。更加完整的配置请查看链接 https://bedezign.github.io/yii2-audit/docs/module-configuration/123456&lt;?php$config = [ 'modules' =&gt; [ 'audit' =&gt; 'bedezign\\yii2\\audit\\Audit', ],]; 然后访问yourdomain.com/index.php?r=audit 即可查看访问详细情况。如图： 2.Audit功能使用介绍按照1.安装里面介绍的步骤，可能会出现没有权限访问的情况，那么接下来介绍如何配置该插件并详细介绍其功能。 2.1 【Entries】记录Web、Cli请求 记录字段如下: 记录字段名称 解释 其它说明 User 默认记录操作用户ID - IP 记录操作者IP - Request Method 请求方法 例如GET、POST、HEAD、PUT等 Ajax 是否是异步请求 - Route 请求的路由地址 - Duration 请求响应时长 - Memory 内存占用 - Created 请求时间 - 配置 本功能是插件的核心功能，因此若要使用其它功能，必须先把这里配置好。 完整配置请查看：https://bedezign.github.io/yii2-audit/docs/module-configuration/ 以下内容均为config/main.php配置文件的内容。123456'modules' =&gt; [ 'audit' =&gt; [ 'class' =&gt; 'bedezign\\yii2\\audit\\Audit', //在此加入下文介绍的配置 ]] db 指定数据库连接在使用了多数据库后，可以通过以下配置来指定一个数据库链接。 1'db' =&gt; 'myAuditDatabase', trackActions 要监听的action 1'trackActions' =&gt; ['*'], //监听全部action ignoreActions 要屏蔽的action，设置后将不在日志里记录这些action 1'ignoreActions' =&gt; ['audit/*', 'debug/*'], //设置不记录audit组件内的所有操作和debug路由下的所有操作 accessIps 允许访问audit组件的IP列表 1'accessIps' =&gt; ['127.0.0.1', '192.168.*'], //允许本地IP和192.168.IP段下的IP访问。如果为null则允许任何人访问 accessRoles 允许访问的角色列表 1'accessRoles' =&gt; ['admin'], //设置角色为admin的角色可以访问audit组件。如果为null则允许任何人访问 accessUsers 允许访问的User ID列表。 1'accessUsers' =&gt; [1,2], //设置ID为1或2的用户可以访问audit组件，如果为null则允许任何人访问 maxAge 日志生命周期 单位：天 1'maxAge' =&gt; 'debug', //永不删除 compressData 压缩数据。 panels 日志数据面板 12345'panels' =&gt; [ 'audit/request', //显示请求内容面板 'audit/error', //显示错误信息面板 'audit/trail', //显示数据库信息面板], 支持的面板列表如下： RequestPanel //跟踪所有传入web和控制台的请求数据。 AssetPanel //显示载入的前端资源 ConfigPanel //Yii 和PHP配置 DbPanel //数据库查询信息 ErrorPanel //记录PHP异常、错误。 JavascriptPanel //自动记录JavaScript错误信息 LogPanel //Yii日志 MailPanel //邮件记录 这里必须开启PHP的PHPmail扩展，不然报错 ProfilingPanel //应用程序配置信息 TrailPanel //数据库变更记录 ExtraDataPanel //额外定义的数据 CurlPanel //记录应用的cURL请求。（包含响应，日志，和请求头） SOAPPanel //记录应用的SOAP请求 YourOwnPanel //自定义Panel 通过路由 yourdomain.com/audit/entry/index 查看Web、Cli请求记录。 在记录以上字段的同时，如果配置了【Trails】【Mails】【Javascripts】【Errors】，则会显示对应的，通过该请求造成的【Trails】记录ID，【Mails】记录ID，【Javascripts】记录ID和【Errors】记录ID。如图：在POST hly-base-info/create 的同时，影响了数据库，并且在HlyBaseInfomodel里配置了AuditTrailBehavior，因此会记录数据库变更。数据库变更记录配置详见2.2 这里的Trails ID只是本次请求，导致的所有数据库变更中的最后一个，并不是完整的ID数组，完整的数据库变更还是要在Trails里查看。如图 在此就可以看到数据库完整的变化，这里的Entry ID指向了对应的操作日志。 查看请求详细记录 通过上面的列表，点击最左侧图标进入详细查看。里面提供了类似Yii2 Debug的功能。在显示请求详细的同时，也会附带几个面板[可通过配置决定显示哪些panel。如图： 2.2【Trails】记录数据库变更 记录字段 记录字段名称 解释 其它说明 Entry ID 操作记录ID - User ID 操作者ID - Action 动作 Create、Update、Delete 等 type model路径 eg.backend\\models\\HlyBaseInfo model ID model ID - Field 受影响的字段 - Diff 改变前后对比 这里会列举该记录被操作前的数据和被改变后的数据。如下图： 配置 记录数据库变更也很方便，只需要在需要记录的model的behaviors函数内加入AuditTrailBehavior：123456public function behaviors()&#123; return [ 'bedezign\\yii2\\audit\\AuditTrailBehavior' ];&#125; 比如记录Post表的变更记录。[会记录增/删/改操作]12345678910&lt;?phpclass Post extends \\yii\\db\\ActiveRecord&#123; public function behaviors() &#123; [ 'class'=&gt; 'bedezign\\yii2\\audit\\AuditTrailBehavior' ], &#125;&#125; 效果如图： 2.3 记录JavaScript错误记录 记录字段 记录字段名称 解释 其它说明 Entry ID 操作记录ID - Type 错误类型 - Origin 错误来源 例如 localhost/:31:5 //代表HTML源代码第31行有JavaScript错误 Message 错误信息 例如 Uncaught ReferenceError: alert1 is not defined 配置 记录JavaScript错误记录只需要在view视图里使用audit提供的JSLoggingAsset注册当前资源。 12&lt;?php\\bedezign\\yii2\\audit\\web\\JSLoggingAsset::register($this); 2.4 记录Yii2错误记录 记录字段 记录字段名称 解释 其它说明 Entry ID 操作记录ID - Message 错误信息 - ErrorCode 错误码 - File 文件路径 - Line 导致错误的行号 - Hash 错误哈希值 - Created 创建时间 - 如图： 配置 记录错误需要在配置文件config/main里配置,注意console的errorHandler需要设置成注释中的配置。1234567891011&lt;?php$config = [ 'components' =&gt; [ 'errorHandler' =&gt; [ // web error handler 'class' =&gt; '\\bedezign\\yii2\\audit\\components\\web\\ErrorHandler', // console error handler //'class' =&gt; '\\bedezign\\yii2\\audit\\components\\console\\ErrorHandler', ], ],];","categories":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}],"tags":[{"name":"Yii2","slug":"Yii2","permalink":"https://war9.cn/tags/Yii2/"},{"name":"yii2-audit","slug":"yii2-audit","permalink":"https://war9.cn/tags/yii2-audit/"}],"keywords":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}]},{"title":"Yii2 DatePicker小部件的使用","slug":"Yii2-DatePicker小部件的使用","date":"2018-01-02T03:51:00.000Z","updated":"2018-01-02T07:15:37.539Z","comments":true,"path":"2018/01/02/Yii2-DatePicker小部件的使用.html","link":"","permalink":"https://war9.cn/2018/01/02/Yii2-DatePicker小部件的使用.html","excerpt":"","text":"DatePicker 小部件是一个封装了Bootstrap DatePicker插件到Yii2中的一个插件。可以方便的由用户选择日期，以用于快速输入日期数据。该插件是基于Yii2 BootStrap3制作的。如果浏览器不支持Jquery。该组件仍然支持以下四种类型： Simple Input Markup //常用的简单input输入框类型 Component Markup - Addon Prepended //在input前加入 选择日期&amp;清空栏目 按钮 Component Markup - Addon Appended //在input后加入 选择日期&amp;清空栏目 按钮 Inline / Embedded Markup //嵌入式日期选择框 Date Range Markup (from and to dates) //日期范围,从A日期~B日期。 项目地址: https://github.com/kartik-v/yii2-widget-datepicker文档中未尽事宜查看插件手册：http://demos.krajee.com/widget-details/datepicker 安装 通过composer进行安装. 1composer require kartik-v/yii2-widget-datepicker \"@dev\" 部分参数解释 languge：组件显示语言， 缺省设置为：Yii::$app-&gt;language 。eg:en , zh-CN size: 组件大小 参数范围：[lg, md, sm, xs] name: 输入框input的name属性 如果DatePicker是TYPE_RANGE类型必须设置name2 attribute：设置model的属性。如果DatePicker是TYPE_RANGE类型必须设置attribute2 value：设置input的value属性。如果DatePicker是TYPE_RANGE类型可以设置value2 options: 设置input的其它配置，比如placeholder等。。如果DatePicker是TYPE_RANGE类型可以设置options2. separator: 分隔符。一般用于TYPE_RANGE类型的输入框。将在两个input中间显示一个分隔符。默认为“to”。 pluginEvents：插件事件数组。插件可以绑定以下几个事件[show,hide,clearDate,changeDate,changeMonth,changeYear,changeDecade,changeCentury]绑定事件到自定义函数可以进行如下配置： 12345678pluginEvents = [ \"show\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\", \"hide\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\", \"clearDate\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\", \"changeDate\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\", \"changeYear\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\", \"changeMonth\" =&gt; \"function(e) &#123; # `e` here contains the extra attributes &#125;\",]; readonly:设置input是否只读 pluginOptions：插件配置数组，常用配置如下：完整的配置文档请查看：http://bootstrap-datepicker.readthedocs.io/en/latest/options.html 配置名称 类型 其它说明 autoclose Boolean 默认False，是否自动关闭日期选择框。 clearBtn Boolean 默认False，是否在日期选择框下方显示清空按钮。 container String 默认Body，附加到某个元素上以用于弹出DatePicker。会设置该元素ID为‘#picker-container‘ startDate Date或String 设置该日期，那么该日期之前的日期将不可选择。 endDate Date或String 设置该日期，那么该日期之后的日期将不可选择。 format String 默认“mm/dd/yyyy”。设置日期格式 multidate Boolean或Number 默认False，如果设置为true将允许多选日期。如果特定某个数，将允许选择特定数个日期。 todayBtn Boolean 默认False，是否在日期选择框下方显示今日按钮。点击将输入今日日期。 todayHighlight Boolean 默认False，是否高亮显示今日日期。 type: 组件类型，缺省设置为 TYPE_COMPONENT_PREPEND 或2.参数范围：[TYPE_INPUT, //普通input输入框TYPE_COMPONENT_PREPEND,TYPE_COMPONENT_APPEND,TYPE_INLINE,TYPE_RANGE,TYPE_BUTTON] 以上分别对应 1 ~ 6，使用常量需要DatePicker::常量名称,例如：DatePicker::TYPE_COMPONENT_PREPEND,注意：官方文档中TYPE_INLINE和TYPE_RANGE的常量值不正确，两个常量顺序写错了。正确的TYPE_INLINE = 4,TYPE_RANGE = 5. 类型名称 是否支持手动输入 功能介绍 其它 TYPE_INPUT 支持 普通输入框,点击输入框，弹出日期选择 – TYPE_COMPONENT_PREPEND 支持 在输入框前加入两个按钮，分别是弹出日期选择和清空输入。 – TYPE_COMPONENT_APPEND 支持 在输入框后加入两个按钮，分别是弹出日期选择和清空输入。 – TYPE_RANGE 支持 日期范围专用，需要配置第二个输入框。两个输入框A和B，如果A日期大于B日期会自动将B日期同步为A日期。 必须配置name2或attribute2 参数，否则会报错。使用该选项需要先安装RANGE扩展。安装方法：composer require kartik-v/yii2-field-range “*” TYPE_INLINE 不支持 将总是显示一个嵌入式的日期选择框。输入框将被加上只读属性。 如果要允许输入日期，可以通过inlineOptions设置 TYPE_BUTTON 不支持 仅显示一个按钮，点击弹出日期选择框，值将被赋值到一个隐藏的输入框内。 可以通过buttonOptions进行配置。 快速使用使用的时候记的在头部引用组件。12&lt;?phpuse kartik\\date\\DatePicker; 不使用model的形式不使用ActiveForm和后台传来的model也可以直接在页面里输出该组件，代码如下123456789echo DatePicker::widget([ 'name' =&gt; 'check_issue_date', 'value' =&gt; date('Y-m-d', strtotime('+2 days')), 'options' =&gt; ['placeholder' =&gt; '请选择日期 ...'], 'pluginOptions' =&gt; [ 'format' =&gt; 'yyyy-mm-dd', 'todayHighlight' =&gt; true ]]); 显示效果如图： 使用model+ActiveForm的形式在controller里面将model传递给视图。123456&lt;?php $model = new ServiceHistory(); return $this-&gt;render('create', [ 'model' =&gt; $model, ]);?&gt; 在视图中，先创建ActiveForm，再输出DatePicker代码片段如下：12345678910111213141516171819&lt;?php $form = ActiveForm::begin([]); ?&gt;&lt;?phpecho DatePicker::widget([ 'model' =&gt; $model,//绑定后台传递的model 'attribute' =&gt; 'service_start',//model里的字段 'attribute2' =&gt; 'service_end',//model里的字段 'options' =&gt; ['placeholder' =&gt; '服务开始时间'],//设置input1的提示 'options2' =&gt; ['placeholder' =&gt; '服务结束时间'],//设置input2的提示 'type' =&gt; DatePicker::TYPE_RANGE,//设置插件类型为日期区间类型。 'form' =&gt; $form,//绑定form为activeForm。 'separator' =&gt; '&lt;i class=\"glyphicon glyphicon-resize-horizontal\"&gt;&lt;/i&gt;',//设置分隔符 'pluginOptions' =&gt; [//设置插件配置 'format' =&gt; 'yyyy-mm-dd',//设置日期格式 'autoclose' =&gt; true,//设置日期选择框自动关闭 'todayHighlight' =&gt; true,//设置今日日期高亮 'todayBtn' =&gt; true,//设置在日期选择框下方显示今日按钮。 ], ]);?&gt; 以上代码效果如图：","categories":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}],"tags":[{"name":"Yii2","slug":"Yii2","permalink":"https://war9.cn/tags/Yii2/"},{"name":"DatePicker","slug":"DatePicker","permalink":"https://war9.cn/tags/DatePicker/"},{"name":"widget","slug":"widget","permalink":"https://war9.cn/tags/widget/"}],"keywords":[{"name":"后端","slug":"backend","permalink":"https://war9.cn/categories/backend/"},{"name":"Yii2","slug":"backend/Yii2","permalink":"https://war9.cn/categories/backend/Yii2/"}]},{"title":"第一篇Hexo文章","slug":"第一篇Hexo文章","date":"2017-12-28T07:22:00.000Z","updated":"2017-12-29T05:48:00.068Z","comments":true,"path":"2017/12/28/第一篇Hexo文章.html","link":"","permalink":"https://war9.cn/2017/12/28/第一篇Hexo文章.html","excerpt":"","text":"我的Hexo第一篇文章终于在各种搜索引擎，github搜索下。激动的开始写这篇文章. 时间轴： 2017/12/29 项目迁移到Coding..域名DNS解析转到DNS Pod 2017/12/29 域名DNS解析转到cloudflare下，支持SSL 2017/12/29 设置自定义域名war9.cn 2017/12/28 上传到我的Github 2017/12/27 安装snippet主题 2017/12/27 本地搭建Hexo博客","categories":[{"name":"其它","slug":"other","permalink":"https://war9.cn/categories/other/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://war9.cn/tags/Hexo/"},{"name":"github","slug":"github","permalink":"https://war9.cn/tags/github/"}],"keywords":[{"name":"其它","slug":"other","permalink":"https://war9.cn/categories/other/"}]}]}